       IDENTIFICATION DIVISION.
       PROGRAM-ID.
           AVGX.
      *
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STUDENT ASSIGN TO STUDENT
               FILE STATUS IS STUDENT-FS.
           SELECT AVGRPT ASSIGN TO AVGRPT.
       DATA DIVISION.
       FILE SECTION.
       FD  STUDENT.
       01  STUDENT-IN-RECORD.
           05  LAST-NAME               PIC X(20).
           05  GRADES OCCURS 5 TIMES   PIC 9(3).
           05  FILLER                  PIC X(45).
       FD AVGRPT.
       01  LINE-OUT-RECORD             PICTURE X(80).
      *
       WORKING-STORAGE SECTION.
       01  OUT-OF-CARDS-FLAG           PIC XXX.
       01  BLANK-LINE          PIC X(80) VALUE SPACES.
       01  REPORT-LINE-ITEM.
           05  FILLER      PIC XX.
           05  LAST-NAME   PIC X(20).
           05  LIT1        PIC X(8)    VALUE ' AVG:  '.
           05  AVG-GRADE   PIC ZZ9.99.
           05  FILLER      PIC X(44).

       77  AVERAGE-GRADE   PIC 999V99.
       77  GRADE-TOTAL     PIC 999.
       77  TOTAL-LINES     PIC 999 VALUE 0.
       77  LOOP-COUNTER    PIC 999 VALUE 0.
       77  STUDENT-FS      PIC 99  VALUE 0.
      *
       PROCEDURE DIVISION.
       MAIN-LINE-ROUTINE.
           OPEN INPUT STUDENT.
           OPEN OUTPUT AVGRPT.
           MOVE 'NO' TO OUT-OF-CARDS-FLAG.
           READ STUDENT RECORD
               AT END MOVE 'YES' TO OUT-OF-CARDS-FLAG.
           PERFORM PROCESS-CALCULATE-AVG
               UNTIL OUT-OF-CARDS-FLAG = 'YES'.

           PERFORM PROCESS-END-OF-REPORT.
           CLOSE STUDENT.
           CLOSE AVGRPT.
           STOP RUN.
      *
       PROCESS-CALCULATE-AVG.
           INITIALIZE AVERAGE-GRADE, GRADE-TOTAL.
           MOVE 1 TO LOOP-COUNTER.
           ADD 1 TO TOTAL-LINES.

           PERFORM UNTIL LOOP-COUNTER = 6
               ADD GRADES (LOOP-COUNTER) TO GRADE-TOTAL
               ADD 1 TO LOOP-COUNTER
           END-PERFORM.

           DIVIDE GRADE-TOTAL BY 5 GIVING AVERAGE-GRADE.
           MOVE LAST-NAME OF STUDENT-IN-RECORD TO
               LAST-NAME OF REPORT-LINE-ITEM.
           MOVE AVERAGE-GRADE TO AVG-GRADE OF REPORT-LINE-ITEM.
           MOVE REPORT-LINE-ITEM TO LINE-OUT-RECORD.
           WRITE LINE-OUT-RECORD.
           READ STUDENT RECORD
               AT END MOVE 'YES' TO OUT-OF-CARDS-FLAG.
      *
       PROCESS-END-OF-REPORT.
           MOVE 'TOTAL-LINES' TO REPORT-LINE-ITEM.
           MOVE REPORT-LINE-ITEM TO LINE-OUT-RECORD.
           MOVE SPACES TO LIT1.
           MOVE ALL '.' TO LINE-OUT-RECORD.
           WRITE LINE-OUT-RECORD.
           MOVE TOTAL-LINES TO AVG-GRADE OF REPORT-LINE-ITEM.
           MOVE REPORT-LINE-ITEM TO LINE-OUT-RECORD.
           WRITE LINE-OUT-RECORD.
